app/views/topics/index.html.erb

SELECT `favorites`.* FROM `favorites` WHERE `favorites`.`topic_id` IN (1, 2, 3, 4)
SELECT  1 AS one FROM `users` INNER JOIN `favorites` ON `users`.`id` = `favorites`.`user_id` WHERE `favorites`.`topic_id` = 1 AND `users`.`id` = 13 LIMIT 1
---
            <%= image_tag topic.image.url %>
            <% if !topic.favorite_users.include?(current_user) %>

SELECT `comments`.* FROM `comments` WHERE `comments`.`topic_id` = 15
---
            </p>
            <% topic.comments.each do |comment| %>