app/controllers/comments_controller.rb

INSERT INTO `comments` (`topic_id`, `comment`, `created_at`, `updated_at`) VALUES (15, 'GREAT!!!', '2018-07-09 15:45:29', '2018-07-09 15:45:29')
---
  def create
    @comment = Comment.new(comment_params)

    if @comment.save