app/controllers/favorites_controller.rb

  def create
    favorite = Favorite.new
    favorite.user_id = current_user.id
    favorite.topic_id = params[:topic_id]

    if favorite.save
---
INSERT INTO `favorites` (`user_id`, `topic_id`, `created_at`, `updated_at`) VALUES (13, 3, '2018-07-05 12:44:56', '2018-07-05 12:44:56')