app/controllers/topics_controller.rb

  def index
    @topics = Topic.all.includes(:favorite_users)
    @comments = Comment.all.include(:topic_id)
---
SELECT `topics`.* FROM `topics`
SELECT `comments`.* FROM `comments` WHERE `comments`.`topic_id` = 15

  def create
    @topic = current_user.topics.new(topic_params)

    if @topic.save
---
INSERT INTO `topics` (`user_id`, `description`, `image`, `created_at`, `updated_at`) VALUES (13, 'Triumph!!!!', 'triumph-bonneville-tracker1.jpg', '2018-07-08 07:55:24', '2018-07-08 07:55:24')